[{ "document": { "name": "projects/ai-lab-1-455106/databases/ai-lab-1-db/documents/poses/halasana", "fields": { "breath": { "stringValue": "exhale" }, "posture": { "stringValue": "Halasana, or Plow Pose, begins with lying flat on your back, arms at your sides with palms down. Inhale and lift your legs to a 90degree angle, using your abdominal muscles. As you exhale, roll your pelvis off the floor, bringing your legs over your head until your toes touch the ground behind you. Your tummy is engaged, and the spine is lengthened. The lower back is supported by your hands, which are placed on your back with fingers pointing up, and you can walk your hands up your spine to elevate it. The upper back and shoulder blades should be drawn in as close as possible, and the chest and rib cage are broadened. Your neck and head should be lengthened and relaxed, with space between your neck and the floor. If your toes touch the ground, you can either keep your hands supporting your back or release your arms alongside your body with palms down or interlace your fingers and press your shoulders into the ground to lift your hips. The legs should be straight, and the feet are typically pointed. Breathing is normal and even throughout the pose, holding for about 30 seconds, and the focus is on relaxation and turning inward. " }, "name": { "stringValue": "halasana" } }, "createTime": "2022-07-06T14:49:51.978409Z", "updateTime": "2024-12-21T18:08:20.254335Z" }, "readTime": "2025-01-20T15:18:47.350979Z" } , 
{ "document": { "name": "projects/ai-lab-1-455106/databases/ai-lab-1-db/documents/poses/malasana", "fields": { "breath": { "stringValue": "Exhale" }, "posture": { "stringValue": "Malasana, known as Garland Pose or Yogi Squat, is a deep squatting posture that offers numerous physical and energetic benefits To perform the pose, start with feet wider than hipwidth apart, toes slightly turned outwards As you bend your knees, lower your hips down between your legs, aiming to keep your heels on the floor; if your heels lift, support them with a blanket or mat The torso drops slightly forward as the upper arms come inside the knees, with elbows pressing gently against the inner thighs while you bring your palms together in prayer position at your heart center Lengthen your spine, lifting and extending the torso while keeping your shoulders relaxed, and draw the belly button towards the spine to engage the core The tailbone reaches down towards the earth, and the crown of the head reaches up The breathing pace is typically an exhale as you move into the squat, with smooth breaths throughout the hold, and a final exhale as you release the pose by bringing the fingertips to the floor and slowly straightening the legs into a forward fold The neck is relaxed, aligned with the spine. This helps with strengthening your core. The breathing involved here is exhale!" }, "name": { "stringValue": "malasana" } }, "createTime": "2024-12-13T05:28:11.626255Z", "updateTime": "2024-12-24T10:43:52.013679Z" }, "readTime": "2025-01-20T15:18:47.350979Z" } , 
{ "document": { "name": "projects/ai-lab-1-455106/databases/ai-lab-1-db/documents/poses/padmasana", "fields": { "breath": { "stringValue": "Normal" }, "posture": { "stringValue": "Padmasana, also known as the Lotus Pose, is a crosslegged seated yoga posture where each foot is placed on the opposite thigh. To perform Padmasana, begin by sitting on the floor with your legs stretched out. Bend your right knee and place your right foot on your left thigh, with the sole of the foot facing up and the heel close to your abdomen. Then, bend your left knee, and place the left foot on your right thigh, mirroring the position of the right foot. Both feet should be resting on the opposite thighs, close to the navel. The spine should be erect, the shoulders relaxed, and the head straight. Hands can be placed on the knees in a mudra position such as jnana mudra (thumb and index finger gently touching), with palms facing up or down, or in the lap with palms up. The knees should ideally be close to the floor, and the ankles should not be sickled. During the pose, the focus is on deep, gentle breaths, and the tummy is relaxed. The breathing pace should be slow and controlled, with focus on both inhales and exhales. It is important to avoid straining, and if you are a beginner, consider practicing simpler seated poses or using props for support until you can comfortably achieve the posture. " }, "name": { "stringValue": "Padmasana" } }, "createTime": "2024-12-21T18:43:08.773007Z", "updateTime": "2024-12-21T18:43:09.904703Z" }, "readTime": "2025-01-20T15:18:47.350979Z" } , 
{ "document": { "name": "projects/ai-lab-1-455106/databases/ai-lab-1-db/documents/poses/sukhasana", "fields": { "breath": { "stringValue": "Normal" }, "posture": { "stringValue": "Sukhasana, also known as Easy Pose, is a comfortable seated position that is often used for meditation and relaxation. To get into the pose, start by sitting with your legs stretched out in front of you, then bend your knees and cross your shins, placing each foot beneath the opposite knee, allowing the outer edges of your feet to rest comfortably on the floor. Your legs should be drawn in close to your torso as is comfortable, with the pelvis in a neutral position. The spine should be lengthened, with the tailbone rooted down and the crown of the head reaching upwards, creating a long spine. Engage your core, relax your shoulders, and move your shoulder blades slightly towards each other. Your hands can rest in your lap, one inside the other, or on your knees with your palms facing up or down. The neck should be aligned with the spine, with a slight lift of the chin. Breathing should be slow, deep, and even, with focus on the sensation of the breath moving in and out of the body. The tummy should be relaxed, and there should be no tension in the face, shoulders, or neck. You should maintain this posture for a few minutes, or as long as it feels comfortable, switching the cross of your legs to maintain balance. " }, "name": { "stringValue": "Sukhasana" } }, "createTime": "2024-12-21T18:40:23.857887Z", "updateTime": "2024-12-21T18:40:28.933647Z" }, "readTime": "2025-01-20T15:18:47.350979Z" } , 
{ "document": { "name": "projects/ai-lab-1-455106/databases/ai-lab-1-db/documents/poses/tadasana", "fields": { "breath": { "stringValue": "Inhale and Exhale" }, "posture": { "stringValue": "Tadasana, also known as Mountain Pose, is a foundational standing asana in yoga, that aims to improve posture, balance, and overall body alignment. For the feet, you can stand with big toes touching and heels slightly apart or with feet hip-width apart, ensuring even pressure distribution across the four corners of each foot (big toe mount, inner heel, small toe mount, and outer heel), while lifting the arches. Keep the knees slightly bent or soft, engaging the quadriceps and lifting the kneecaps upwards. The pelvis should be in a neutral position, maintaining the natural curve of the lower back and with core muscles activated. The spine should be elongated, with the chest broadened, and shoulder blades drawn together and down the back. The arms should be relaxed by your sides with palms facing forward, spreading hands, and activating the fingers. The neck should be long with the head held straight, the crown of the head lifting towards the sky as if a golden thread is attached to it. Your gaze should be soft and focused on a fixed point. Throughout the pose, the breathing should be slow, deep, and relaxed and you should imagine a line of energy extending from your feet through your legs and spine and out through the crown of your head.\r\n" }, "name": { "stringValue": "tadasana" } }, "createTime": "2022-07-02T09:32:10.030550Z", "updateTime": "2024-12-21T18:55:19.130799Z" }, "readTime": "2025-01-20T15:18:47.350979Z" } , 
{ "document": { "name": "projects/ai-lab-1-455106/databases/ai-lab-1-db/documents/poses/trikonasana", "fields": { "breath": { "stringValue": "Exhale" }, "posture": { "stringValue": "In Trikonasana, stand with legs wide apart, turn one foot out 90 degrees and the other slightly in, extend arms parallel to the floor, then bend sideways from hips, placing one hand on the shin or floor. Inhale as you lengthen the spine and exhale as you bend to the side, keeping your tummy engaged, spine long, and the neck in line with the spine or turned to look up; palms facing forward if the arm is extended to the ceiling, with relaxed shoulders. Feet are firmly planted, legs are straight and engaged, with the core muscles activated. This pose enhances flexibility, strengthens the legs and core, and can reduce stress and improve digestion. " }, "name": { "stringValue": "Trikonasana" } }, "createTime": "2024-12-24T10:26:00.840271Z", "updateTime": "2024-12-24T10:44:29.083151Z" }, "readTime": "2025-01-20T15:18:47.350979Z" } , 
{ "document": { "name": "projects/ai-lab-1-455106/databases/ai-lab-1-db/documents/poses/urdhvahastasana", "fields": { "breath": { "stringValue": "inhale" }, "posture": { "stringValue": "Urdhva Hastasana, also known as Upward Salute or Palm Tree Pose, is a standing yoga pose that involves a full-body stretch. To perform the pose, begin in Tadasana (Mountain Pose) with feet either together or hip-width apart, ensuring your weight is evenly distributed across all four corners of your feet. As you inhale, sweep your arms out to the sides and then overhead, reaching towards the sky, with palms facing each other or together in prayer. Maintain a microbend in your knees to avoid locking them. Engage your quadriceps, rotating your inner thighs back and gently pressing your outer shins toward each other while drawing your tailbone down without rounding your spine. The tummy is engaged without constricting breath. Lengthen your spine, broaden your collarbones, and elongate your neck, drawing your shoulders away from your ears to open the chest. The upper back should be broad and lifted upwards and lower back should maintain its natural curve. The spine is straight and lifted from the base. Your gaze can be straight ahead, diagonally upward, or towards your hands if comfortable. Breathe deeply and smoothly throughout the pose, usually inhaling as you raise your arms and maintaining a steady breath while holding the pose.\r\n" }, "name": { "stringValue": "urdhvahastasana" } }, "createTime": "2022-07-02T09:31:56.581197Z", "updateTime": "2024-12-21T18:06:41.861023Z" }, "readTime": "2025-01-20T15:18:47.350979Z" } , 
{ "document": { "name": "projects/ai-lab-1-455106/databases/ai-lab-1-db/documents/poses/uttanasana", "fields": { "breath": { "stringValue": "inhale" }, "posture": { "stringValue": "Uttanasana, also known as the standing forward bend, is a foundational yoga posture that involves a deep forward fold from the hips. To perform it, start in Tadasana (mountain pose) with feet hipwidth apart, grounding through all four corners of your feet, with slightly more weight in the balls of the feet. As you inhale, extend your arms overhead, and on the exhale, hinge at your hips, folding forward while keeping your back as flat as possible. The tummy should be engaged, and spine should be lengthened during the movement. In the full pose, your upper back should be broad and relaxed, with the lower back extending without rounding. Your feet should be parallel and grounded, with legs either straight or slightly bent depending on hamstring flexibility and preference. Hands can rest on the floor beside your feet, on your legs, or on blocks if needed. The neck and head should be relaxed, allowing the crown of the head to move towards the floor. Breathing is synchronized with the movement inhale to lengthen the spine and exhale to deepen the fold; during the pose, continue to breathe deeply, allowing the belly to be relaxed, with a focus on the expansion of the back as you inhale, and using the exhale to release further into the pose. " }, "name": { "stringValue": "uttanasana" } }, "createTime": "2024-12-21T18:07:33.253455Z", "updateTime": "2024-12-21T18:07:34.124911Z" }, "readTime": "2025-01-20T15:18:47.350979Z" } , 
{ "document": { "name": "projects/ai-lab-1-455106/databases/ai-lab-1-db/documents/poses/virabadrasana", "fields": { "breath": { "stringValue": "Exhale" }, "posture": { "stringValue": "Virabhadrasana, also known as Warrior Pose, is a group of related lunging standing asanas in modern yoga. In Virabhadrasana I, the feet are about 34 feet apart, with the front foot pointing forward and the back foot turned inward at about a 45degree angle, the front knee bent at a 90degree angle directly over the ankle, while the back leg is straight and strong and the hips are squared forward. Inhale as you raise the arms overhead, keeping them parallel, or you can bring your palms together and look up at your thumbs, and the neck and head are extended, gazing upwards, and the spine is lengthened with the tummy slightly engaged. The breathing is coordinated with the movements, with an inhale as you raise the arms and settle into the pose and an exhale as you come out of the pose. In Virabhadrasana II, the feet are spread wide with the front foot pointing forward and the back foot turned slightly inward and the front knee bent at a 90degree angle directly over the ankle, while the torso remains facing forward and the arms are extended straight out to the sides at shoulder level with the palms facing down, with your gaze directed forward over the front hand, with your spine straight and tummy slightly engaged. In Virabhadrasana III, you start in a high lunge with the weight shifted forward, the front leg straight, and the back leg lifted, parallel to the floor, the torso is also parallel to the floor, arms can be stretched forward, out to the sides, or back alongside the body with gaze forward, with your spine straight and tummy slightly engaged. " }, "name": { "stringValue": "virabadrasana" } }, "createTime": "2022-07-06T14:50:22.496329Z", "updateTime": "2024-12-21T17:26:21.596623Z" }, "readTime": "2025-01-20T15:18:47.350979Z" } , 
{ "document": { "name": "projects/ai-lab-1-455106/databases/ai-lab-1-db/documents/poses/vrksasana", "fields": { "breath": { "stringValue": "Inhale and Exhale" }, "posture": { "stringValue": "Vrksasana, or Tree Pose, is a balancing asana that begins from Tadasana (Mountain Pose). To perform it, shift your weight to one leg, ensuring the foot is grounded and stable. Bend the other knee and place the sole of the foot on the inner thigh or calf of the standing leg, avoiding the knee joint. The knee of the bent leg should point outwards. Engage your core muscles and lengthen the spine, keeping it straight. The pelvis should remain neutral, and the gaze fixed on a point in front to aid balance. The hands can be in a prayer position at the heart center or extended overhead with palms together or shoulderwidth apart, resembling the branches of a tree. Breathing should be rhythmic and deep, inhaling as you raise your arms and exhaling as you settle into the pose and deepen the stretch. Hold the pose for 2030 seconds initially, gradually increasing the duration, and focus on the stretch in the abdominal muscles and strengthening the calves during exhalations. Maintain a microbend in the standing knee, pressing the foot into the thigh while countering the pressure with the thigh pushing back into the foot. " }, "name": { "stringValue": "Vrksasana" } }, "createTime": "2024-12-15T05:19:43.752111Z", "updateTime": "2024-12-15T05:19:45.676415Z" }, "readTime": "2025-01-20T15:18:47.350979Z" } 
]
